Revit 2027 API
DirectShapeType.RemoveExternallyTaggedGeometry Method
 Removes the externally tagged geometry object by its external ID from this DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveExternallyTaggedGeometry(
	ExternalGeometryId externalId
)
Public Sub RemoveExternallyTaggedGeometry (
	externalId As ExternalGeometryId
)
public:
void RemoveExternallyTaggedGeometry(
	ExternalGeometryId^ externalId
)
member RemoveExternallyTaggedGeometry :
        externalId : ExternalGeometryId -> unit
Parameters
externalId ExternalGeometryId
 The external ID of the externally tagged geometry that should be removed.
Exceptions
Exception | Condition
ArgumentException |  The externally tagged geometry with the input externalId is not present in this DirectShapeType.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace